#### IsolateCategoriesTemporary Method

---

|  |
| --- |
| View Class   See Also |

Set categories to be temporarily isolated in the view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public void IsolateCategoriesTemporary( 	ICollection<ElementId> elementIds ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub IsolateCategoriesTemporary ( _ 	elementIds As ICollection(Of ElementId) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void IsolateCategoriesTemporary( 	ICollection<ElementId^>^ elementIds ) ``` |

#### Parameters

elementIds
:   Type:  System.Collections.Generic ICollection   ElementId
     Ids of categories to be isolated.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Some elements in elementIds do not correspond to a Category. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

View Class

Autodesk.Revit.DB Namespace